/*Доп 1 Перестановки
    Дана строка, состоящая из N попарно различных символов.
    Требуется вывести все перестановки символов данной строки.

Входные данные: 
    строка, состоящая из N символов (1 ≤ N ≤ 8), символы - буквы английского алфавита и цифры.

Выходные данные:
    выведите в каждой строке по одной перестановке.
    Перестановки можно выводить в любом порядке.
    Повторений и строк, не являющихся перестановками исходной, быть не должно.

    AB	AB
        BA

IOX	    XOI
        OIX
        IXO
        XIO
        OXI
        IOX
Алгоритм:
    1. Посчитаем количество символов в строке
    2. 

*/