Console.Clear();
// Console.WriteLine("Hello, World!");

Console.Write("Введите первое число: ");
// Способ ввода данных 1
int number1 = int.Parse(Console.ReadLine());

Console.Write("Введите второе число: ");
// Способ ввода данных 2
int number2 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine(number1 * 2);
// Console.WriteLine(number2 * 3);

Console.Write("Первое число больше чем второе? ");
Console.WriteLine(number1 > number2);

// Напишите программу, которая на вход 

